; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-3-5-7-7-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 truck2 truck3 truck4 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear crate1)
	(at pallet4 distributor0)
	(clear pallet4)
	(at pallet5 distributor1)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at truck0 distributor2)
	(at truck1 depot3)
	(at truck2 distributor2)
	(at truck3 depot1)
	(at truck4 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot3)
	(on crate1 pallet3)
	(at crate2 depot1)
	(on crate2 pallet1)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 pallet0)
		(on crate2 pallet2)
	)
))

; plan
1. (lift hoist3 crate1 pallet3 depot3)
   deleted: (at crate1 depot3) (available hoist3) (on crate1 pallet3) (clear crate1)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 0 of 3
2. (load hoist3 crate1 truck1 depot3)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 0 of 3
3. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 0 of 3
4. (drive truck1 depot3 depot0)
   deleted: (at truck1 depot3)
   added: (at truck1 depot0)
   goals met: 0 of 3
5. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 0 of 3
6. (unload hoist0 crate1 truck1 depot0)
   deleted: (available hoist0) (in crate1 truck1)
   added: (lifting hoist0 crate1)
   goals met: 0 of 3
7. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 3
8. (load hoist1 crate2 truck3 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck3) (available hoist1)
   goals met: 0 of 3
9. (drive truck3 depot1 depot2)
   deleted: (at truck3 depot1)
   added: (at truck3 depot2)
   goals met: 0 of 3
10. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 0 of 3
11. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   goals met: 1 of 3
12. (unload hoist1 crate0 truck1 depot1)
   deleted: (available hoist1) (in crate0 truck1)
   added: (lifting hoist1 crate0)
   goals met: 1 of 3
13. (drop hoist1 crate0 pallet1 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (at crate0 depot1) (available hoist1) (on crate0 pallet1) (clear crate0)
   goals met: 2 of 3
14. (unload hoist2 crate2 truck3 depot2)
   deleted: (available hoist2) (in crate2 truck3)
   added: (lifting hoist2 crate2)
   goals met: 2 of 3
15. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (at crate2 depot2) (available hoist2) (on crate2 pallet2) (clear crate2)
   goals met: 3 of 3
